{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2552a526-a919-466e-9a27-64aed803c247')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2552a526-a919-466e-9a27-64aed803c247')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "MFA Rejected by User",
                "description": "This analytic rule detects sign-in attempts where the user explicitly rejected or declined the Multi-Factor Authentication (MFA) prompt. It identifies two critical scenarios (Voluntary rejection or Fraud alert)",
                "severity": "Medium",
                "enabled": true,
                "query": "SigninLogs\r\n| where ResultType == 500121\r\n| extend additionalDetails = tostring(Status.additionalDetails)\r\n| extend UserPrincipalName = tolower(UserPrincipalName)\r\n| where additionalDetails =~ \"MFA denied; user declined the authentication\" or additionalDetails has \"fraud\"",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT5H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "InitialAccess"
                ],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": null,
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}
